**Paramètres:**

In [1]:
# Configuration production
number_members = 10000
number_providers = 200
number_corporation = 500
number_loans = 50000

# Configuration dev
number_members = 1000
number_providers = 20
number_corporation = 50
number_loans = 500

**Dénormalisation retenue:**

In [2]:
{
    "members":
    {
        "member_no": "1",
        "lastname": "DOUGLAS",
        "firstname": "Michael",
        "phone_number":"blabla",
 
        "location":
        {
            "country":"France",
            "region_no":"IDF",
            "city":"Paris",
            "mail_code":"75000",
            "street":"blabla"
        },
 
        "balance":
        {
            "prev_balance": "1000",
            "curr_balance": "1200"
        },
 
        "_comment":"No need to have a list, each employee have only 1 corporation",
        "corporation":
        {
            "corp_no":1,
            "corp_name":"blabla",
            "region_no":"XX"
        },
 
        "charge": [
            {
                "charge_no": "125",
                "category_no": "12",
                "category_desc": "Travel",
                "charge_dt": "2000-02-22 10:43:38",
                "charge_amount": "336.0000",
 
                "provider_no":12,
                "provider_name":"BNP Paribas",
                "provider_phone_number": "blabla",
                "payments":[1546, 1547,... , 1578]
            }
        ]
},
     "providers":
        {
            "provider_no":1,
            "provider_name":"BNP",
            "location":
            {
                "country":"France",
                "region_no":"IDF",
                "city":"Paris",
                "mail_code":"75000"
            }
        },
 
 
    "payments":
        {
            "payment_no":1546,
            "payment_dt":"2000-02-22 10:43:38",
            "payment_amt":125.00
        }
}

{'members': {'member_no': '1',
  'lastname': 'DOUGLAS',
  'firstname': 'Michael',
  'phone_number': 'blabla',
  'location': {'country': 'France',
   'region_no': 'IDF',
   'city': 'Paris',
   'mail_code': '75000',
   'street': 'blabla'},
  'balance': {'prev_balance': '1000', 'curr_balance': '1200'},
  '_comment': 'No need to have a list, each employee have only 1 corporation',
  'corporation': {'corp_no': 1, 'corp_name': 'blabla', 'region_no': 'XX'},
  'charge': [{'charge_no': '125',
    'category_no': '12',
    'category_desc': 'Travel',
    'charge_dt': '2000-02-22 10:43:38',
    'charge_amount': '336.0000',
    'provider_no': 12,
    'provider_name': 'BNP Paribas',
    'provider_phone_number': 'blabla',
    'payments': [1546, 1547, Ellipsis, 1578]}]},
 'providers': {'provider_no': 1,
  'provider_name': 'BNP',
  'location': {'country': 'France',
   'region_no': 'IDF',
   'city': 'Paris',
   'mail_code': '75000'}},
 'payments': {'payment_no': 1546,
  'payment_dt': '2000-02-22 10:43:38',
  'payment_amt': 125.0}}

In [3]:
Bank_list = [
    "Goldman Sachs",
    "Morgan Stanley",
    "Bank of America",
    "Citigroup",
    "JPMorgan Chase & Co",
    "Wells Fargo",
    "PNC Financial Services",
    "US Bank",
]

In [4]:
!pip install random-address

Requirement already satisfied: random-address in /opt/homebrew/Caskroom/miniforge/base/lib/python3.9/site-packages (1.1.1)

In [5]:
from faker import Faker
import pandas as pd
from random import randint, random, seed, randrange
import numpy as np
import math
seed(22) #random seed

from datetime import timedelta
from dateutil.relativedelta import relativedelta

from random_address import real_random_address

fake = Faker()

In [6]:
Members = pd.DataFrame([{
    "member_no": i,
    "lastname": fake.last_name_nonbinary(),
    "firstname": fake.first_name_nonbinary(),
    "phone_number": '0'+fake.msisdn()[3:] ,

    "country": "United States",
    "region_no": address['state'],
    "city": address['city'] if 'city' in address.keys() else 'Boston' ,
    "mail_code": address['postalCode'],
    "street": address['address1']
} for (i,address) in zip(range(number_members),[real_random_address() for i in range(number_members)]) ])
Members

,member_no,lastname,firstname,phone_number,country,region_no,city,mail_code,street
0,0,Booker,Alexander,03467206581,United States,AR,Fayetteville,72701,17 West 26th Circle
1,1,Collins,Cynthia,05877106496,United States,KY,Louisville,40211,1522 South 36th Street
2,2,Gates,Christine,07112805123,United States,CA,Carson,90810,21950 Arnold Center Road
3,3,Watson,Rose,04613805255,United States,FL,Southport,32409,711 Tashanna Lane
4,4,Adkins,Jessica,01920641071,United States,TN,Nashville,37208,1816 14th Avenue
...,...,...,...,...,...,...,...,...,...
995,995,Johnson,David,05215591838,United States,CT,Manchester,06040,207 High Street
996,996,Costa,Marissa,06382176922,United States,OK,Oklahoma City,73118,1136 Northwest 31st Street
997,997,Khan,James,06220923360,United States,KY,Louisville,40211,2728 Hale Avenue
998,998,Reeves,Thomas,02299151551,United States,CA,Newark,94560,5715 Saint Matthew Drive
999,999,Horton,Nicole,08436260068,United States,MA,Medway,02053,14 School Street

In [7]:
Members.to_csv('members.csv')

In [8]:
Providers = pd.DataFrame([{
    "provider_no": i,
    "provider_name": Bank_list[randint(0, len(Bank_list)-1)],
    "phone_number": '0'+fake.msisdn()[3:] ,
    "country": "United States",
    "region_no": address['state'],
    "city": address['city'] if 'city' in address.keys() else 'Boston' ,
    "mail_code": address['postalCode'],
    "street": address['address1'],
    "corp_no": randint(0, number_corporation-1)
} for (i,address) in zip(range(number_providers),[real_random_address() for i in range(number_providers)]) ])
Providers

,provider_no,provider_name,phone_number,country,region_no,city,mail_code,street,corp_no
0,0,Morgan Stanley,05714975151,United States,OK,Midwest City,73110,4408 Bonaparte Boulevard,10
1,1,JPMorgan Chase & Co,07643464419,United States,FL,Panama City,32404,5242 Thornton Lane,28
2,2,JPMorgan Chase & Co,03625548060,United States,AR,Fayetteville,72701,962 South Silverado Drive,35
3,3,Morgan Stanley,06681172159,United States,CA,Union City,94587,31353 Santa Elena Way,21
4,4,Bank of America,06174478754,United States,OK,Moore,73160,1513 Southeast 9th Street,16
5,5,Goldman Sachs,01771447569,United States,GA,Savannah,31419,103 Fenwick Village Drive,24
6,6,JPMorgan Chase & Co,02605138045,United States,AK,Anchorage,99577,25721 Berryhill Road,25
7,7,Goldman Sachs,08162631877,United States,AR,Fayetteville,72704,3537 West Chevaux Drive,6
8,8,US Bank,03569214452,United States,AR,Fayetteville,72703,4075 North Cadillac Drive,46
9,9,Morgan Stanley,02464101872,United States,GA,Pooler,31322,5 Tranquil Place,47
10,10,Wells Fargo,07784365260,United States,TN,Nashville,37210,90 Peabody Street,48
11,11,JPMorgan Chase & Co,04124882698,United States,CT,Manchester,06040,12 Kane Road,45
12,12,Bank of America,03008968459,United States,KY,Louisville,40245,1112 Flat Rock Road,40
13,13,Bank of America,05103109975,United States,AZ,Glendale,85308,6451 West Bell Road,41
14,14,Citigroup,03989950282,United States,CO,Fort Collins,80525,3438 Carlton Avenue,49
15,15,Citigroup,04852266119,United States,KY,Louisville,40218,1903 Bashford Manor Lane,30
16,16,Goldman Sachs,07142482021,United States,MA,Quincy,02169,45 Brackett Street,31
17,17,PNC Financial Services,03973750916,United States,AK,Anchorage,99516,16244 Seville Park Circle,6
18,18,PNC Financial Services,07608888666,United States,GA,Savannah,31415,1350 Exley Street,39
19,19,PNC Financial Services,09143122688,United States,CT,Manchester,06040,149 Lenox Street,10

In [9]:
Providers.to_csv('providers.csv')

In [10]:
Corporations = pd.DataFrame([{
    "corp_no": i,
    "corp_name": fake.company(),
    "phone_number": '0'+fake.msisdn()[3:] ,
    "country": "United States",
    "region_no": address['state'],
    "city": address['city'] if 'city' in address.keys() else 'Boston' ,
    "mail_code": address['postalCode'],
    "street": address['address1']
} for (i,address) in zip(range(number_corporation),[real_random_address() for i in range(number_corporation)]) ])
Corporations

,corp_no,corp_name,phone_number,country,region_no,city,mail_code,street
0,0,"Barrera, Schmidt and Green",03407380857,United States,AZ,Glendale,85301,8595 North 71st Avenue
1,1,Zimmerman LLC,09006899744,United States,MA,Brookline,02446,19 Euston Street
2,2,"Williams, Jackson and Wood",04032788044,United States,AL,Montgomery,36116,3617 Oak Grove Circle
3,3,"Bishop, Martinez and Walker",08330738345,United States,CT,Manchester,06040,28 Wilfred Road
4,4,"Guerra, Coffey and Chaney",08331433557,United States,CA,Livermore,94550,266 South J Street
5,5,Mendoza PLC,07003149499,United States,AK,Anchorage,99507,4107 East 68th Avenue
6,6,Mckenzie PLC,06140095904,United States,KY,Louisville,40205,3408 Taylorsville Road
7,7,Cervantes and Sons,05969450454,United States,CA,Mountain View,94040,1954 Wilson Court
8,8,Reynolds-Bell,04715719510,United States,CO,Arvada,80002,8391 West 52nd Avenue
9,9,Smith-Allen,09975513839,United States,GA,Calhoun,30701,103 Aspen Place Northeast
10,10,Brewer-Hansen,01365855723,United States,AK,Anchorage,99517,3871 Galactica Drive
11,11,Holmes-James,01038086811,United States,CO,Arvada,80007,16896 West 85th Lane
12,12,Morgan Group,01860719679,United States,CA,Alameda,94501,11 Eclipse Court
13,13,"Hoffman, Gentry and Lawrence",02744525682,United States,DC,Washington,20011,5575 South Dakota Avenue Northeast
14,14,Campbell PLC,08628425864,United States,TN,Nashville,37214,846 Allen Road
15,15,"Brooks, Green and Fletcher",08078460427,United States,AL,Montgomery,36117,5680 Eddins Road
16,16,"Powell, Jones and Wagner",01436881552,United States,OK,Oklahoma City,73112,4132 Northwest 57th Street
17,17,Norton-Lowe,08383649067,United States,CT,Manchester,06040,200 West Center Street
18,18,Kelley and Sons,08256516534,United States,AR,Fayetteville,72701,412 West Ila Street
19,19,Walker and Sons,03393110655,United States,CA,Hayward,94544,28250 Dickens Avenue
20,20,Wilson-Harvey,03953866610,United States,OK,Oklahoma City,73114,312 Northwest 90th Street
21,21,"Jenkins, Shields and Palmer",09622207695,United States,FL,Panama City Beach,32408,4216 Lorraine Street
22,22,"Simmons, Tran and Moore",02974840329,United States,MD,Edgewater,21037,3579 2nd Avenue
23,23,Conner-Lindsey,08494769937,United States,FL,Panama City,32405,1803 Hickory Avenue
24,24,Weaver PLC,06437651484,United States,CT,Manchester,06040,173 Center Street
25,25,Gilbert LLC,07440445386,United States,AK,Anchorage,99508,2613 Cottonwood Street
26,26,"Blair, Baxter and Keith",03625502068,United States,AZ,Glendale,85306,5632 West Acoma Drive
27,27,Anderson Ltd,04227515087,United States,FL,Panama City,32408,8221 Surf Drive
28,28,Gonzales-Hart,01152282818,United States,FL,Mexico Beach,32456,3203 US Highway 98
29,29,Wolf Ltd,01706958858,United States,AR,Fayetteville,72701,971 Zenith Loop
30,30,"Spence, Baird and Hernandez",09566957934,United States,AL,Montgomery,36105,240 Lynwood Drive
31,31,Bender-Taylor,04219713858,United States,AR,Fayetteville,72703,2027 North Shannon Drive
32,32,Alexander-Carr,07521664706,United States,FL,Southport,32409,711 Tashanna Lane
33,33,Ward-Stafford,08998053627,United States,CO,Arvada,80007,8820 Culebra Street
34,34,"Hall, Rodriguez and Washington",03835944683,United States,MA,Norwood,02062,756 Neponset Street
35,35,Watson Group,04808787381,United States,MD,Edgewater,21037,241 Braxton Way
36,36,Smith Ltd,00949225310,United States,MA,Medford,02155,15 Mystic Avenue
37,37,"Orr, Estrada and Campbell",06464663016,United States,FL,Panama City Beach,32413,17878 Front Beach Road
38,38,"Knight, Wilson and Gill",08457902970,United States,KY,Louisville,40241,11102 Little Rock Court
39,39,"Oneill, Wise and Stewart",01020254904,United States,CA,Oakland,94621,1314 89th Avenue
40,40,Graves-Mckay,09359683757,United States,FL,Panama City,32404,5119 Marla Drive
41,41,Greene PLC,05462828389,United States,CA,Redding,96002,2641 Heather Lane
42,42,Hawkins Ltd,00609933996,United States,AZ,Peoria,85382,16040 North 67th Drive
43,43,"Snow, Roberts and Guzman",01134357836,United States,FL,Mexico Beach,32456,400 US Highway 98
44,44,Rangel LLC,09509897214,United States,TN,Nashville,37076,804 Old Coach Place
45,45,King and Sons,09758456916,United States,CO,Arvada,80005,7822 Club Crest Drive
46,46,Hall Group,08012565854,United States,CO,Arvada,80003,6215 Sheridan Boulevard
47,47,"Jones, Boyd and Harmon",09126692817,United States,MA,Watertown,02472,605 Main Street
48,48,"Stone, Wallace and Gordon",08056716857,United States,AL,Montgomery,36117,5600 Carmichael Road
49,49,Shelton Inc,04295254733,United States,DC,Washington,20012,6611 5th Street Northwest

In [11]:
credit_categories_list = ["School credit loan", "Real Estate loan", "Consumer loan"]
Categories = pd.DataFrame(credit_categories_list)
Categories['category_no'] = Categories.index
Categories.columns = ['category_name','category_no']
Categories

        category_name  category_no
0  School credit loan            0
1    Real Estate loan            1
2       Consumer loan            2

In [12]:


def get_school_loan():
    mu = 125000
    sigma = 1.2*mu
    x = int(np.random.normal(mu, sigma, 1)[0])
    return  x if x > 0 else mu

def get_real_estate_loan():
    mu = 500000
    sigma = 3*mu
    x = int(np.random.normal(mu, sigma, 1)[0])
    return  x if x > 0 else mu

def get_consummer_loan():
    mu = 5000
    sigma = 4*mu
    x = int(np.random.normal(mu, sigma, 1)[0])
    return  x if x > 0 else mu

def get_loan(category_no):
    
    loan_type = Categories[Categories['category_no']==category_no]['category_no'].values[0]
    if loan_type == "School credit loan":
        return get_school_loan()
    elif loan_type == "Real Estate loan":
        return get_real_estate_loan()
    else:
        return get_consummer_loan()

In [13]:
def random_date(start, end):
    delta = end - start
    random_days = randrange(delta.days)
    return start + timedelta(days=random_days)

from datetime import datetime
d1 = datetime.strptime('1/1/2020', '%m/%d/%Y')
d2 = datetime.strptime('1/1/2022', '%m/%d/%Y')
print(random_date(d1, d2))

2021-07-01 00:00:00

In [14]:
loans = [[
    category_no, get_loan(category_no)
] for category_no in [randint(0, len(credit_categories_list)-1) for i in range(number_loans)]]
#loans

In [15]:
loans = pd.DataFrame(loans)
loans.columns = ['loan_type', 'loan_amuont']
loans

     loan_type  loan_amuont
0            0        11928
1            1         5000
2            1        43430
3            0          595
4            1        16357
..         ...          ...
495          1         5000
496          1         5000
497          0         5000
498          0        16035
499          0        25485

[500 rows x 2 columns]

In [16]:
charge_duration = [[i*12 for i in range(1,6)][randint(0, 4)] for j in range(len(loans))]

In [17]:
member_no = [randint(0, len(Members)-1) for i in range(len(loans))]

In [18]:
provider_no = [randint(0, len(Providers)-1) for i in range(len(loans))]

In [19]:
charge_dt = [random_date(d1, d2) for i in range(len(loans))]

In [20]:
Charges = pd.DataFrame([loans.loan_type.values, loans.loan_amuont.values, charge_duration, charge_dt, member_no, provider_no]).T
Charges.columns = ["Charge type", "Charge amount", "Duration", "dt", "member_no", "provider_no"]
Charges["charge_no"] = Charges.index
Charges

,Charge type,Charge amount,Duration,dt,member_no,provider_no,charge_no
0,0,11928,24,2020-03-29,344,17,0
1,1,5000,48,2021-05-19,898,14,1
2,1,43430,36,2020-03-30,497,2,2
3,0,595,12,2021-12-09,697,19,3
4,1,16357,12,2021-01-27,864,18,4
...,...,...,...,...,...,...,...
495,1,5000,60,2020-06-30,36,9,495
496,1,5000,60,2020-01-10,261,19,496
497,0,5000,36,2021-05-12,897,9,497
498,0,16035,48,2020-02-04,267,6,498
499,0,25485,36,2021-11-28,743,3,499

**On considère que le dataset correspond à l'état des paiements des crédit en date du 1 octobre 2021.**

**Par conséquent un emprûnt est en règle si tout les "statements" dont la due_dt est précédente au 1 octobre 2021 liés à cet umprunt ont été honorés.**

In [21]:
dt_1er_octobre_2021 = datetime(2020, 9, 1)
dt_1er_octobre_2021

datetime.datetime(2020, 9, 1, 0, 0)

In [22]:
def remboursera(row):
    if random() <= 0.98:
        return True
    else:
        return False


# In[17]:


def mois_de_defaut(row):
    if row['remboursera'] == False:
        moisDeDefaut = randint(0, row['Duration']-1)
        return moisDeDefaut
    else:
        return np.NaN

In [23]:
Charges['remboursera'] = Charges.apply(lambda row: remboursera(row), axis = 1)
Charges

,Charge type,Charge amount,Duration,dt,member_no,provider_no,charge_no,remboursera
0,0,11928,24,2020-03-29,344,17,0,True
1,1,5000,48,2021-05-19,898,14,1,True
2,1,43430,36,2020-03-30,497,2,2,True
3,0,595,12,2021-12-09,697,19,3,True
4,1,16357,12,2021-01-27,864,18,4,True
...,...,...,...,...,...,...,...,...
495,1,5000,60,2020-06-30,36,9,495,True
496,1,5000,60,2020-01-10,261,19,496,True
497,0,5000,36,2021-05-12,897,9,497,True
498,0,16035,48,2020-02-04,267,6,498,True
499,0,25485,36,2021-11-28,743,3,499,True

In [24]:
Charges['Mois de défaut'] = Charges.apply(lambda row: mois_de_defaut(row), axis = 1)

In [25]:
t = [[
    [
        Charges["Charge amount"].iloc[i]/Charges["Duration"].iloc[i],
        Charges['dt'][i] + relativedelta(months=+j+1),
        j,
        Charges['charge_no'][i],
        Charges["member_no"][i]
    ] for j in range(Charges["Duration"][i])
] for i in range(len(Charges))]




Statements = pd.DataFrame([item for sublist in t for item in sublist])
Statements.columns = ["statement_amt","due_dt", "charge_statement_no","charge_no", "member_no"]
Statements["statement_no"] = Statements.index
Statements

,statement_amt,due_dt,charge_statement_no,charge_no,member_no,statement_no
0,497.000000,2020-04-29,0,0,344,0
1,497.000000,2020-05-29,1,0,344,1
2,497.000000,2020-06-29,2,0,344,2
3,497.000000,2020-07-29,3,0,344,3
4,497.000000,2020-08-29,4,0,344,4
...,...,...,...,...,...,...
18223,707.916667,2024-07-28,31,499,743,18223
18224,707.916667,2024-08-28,32,499,743,18224
18225,707.916667,2024-09-28,33,499,743,18225
18226,707.916667,2024-10-28,34,499,743,18226
18227,707.916667,2024-11-28,35,499,743,18227

In [26]:
t = [[
    [
        Charges["Charge amount"].iloc[i]/Charges["Duration"].iloc[i],
        Charges['dt'][i] + relativedelta(months=+j+1),
        j,
        Charges['charge_no'][i],
        Charges["member_no"][i]
    ]
    for j in range(Charges["Duration"][i]) if (Charges['Mois de défaut'][i] != np.NaN) |(j < Charges['Mois de défaut'][i])
] for i in range(len(Charges))]

In [27]:
Payments = pd.DataFrame([item for sublist in t for item in sublist])
Payments.columns = ["payment_amt","due_dt", "charge_statement_no","charge_no", "member_no"]
Payments["payment_no"] = Payments.index
Payments

,payment_amt,due_dt,charge_statement_no,charge_no,member_no,payment_no
0,497.000000,2020-04-29,0,0,344,0
1,497.000000,2020-05-29,1,0,344,1
2,497.000000,2020-06-29,2,0,344,2
3,497.000000,2020-07-29,3,0,344,3
4,497.000000,2020-08-29,4,0,344,4
...,...,...,...,...,...,...
18223,707.916667,2024-07-28,31,499,743,18223
18224,707.916667,2024-08-28,32,499,743,18224
18225,707.916667,2024-09-28,33,499,743,18225
18226,707.916667,2024-10-28,34,499,743,18226
18227,707.916667,2024-11-28,35,499,743,18227

In [28]:
Payments = Payments[Payments["due_dt"] < dt_1er_octobre_2021]
Payments

,payment_amt,due_dt,charge_statement_no,charge_no,member_no,payment_no
0,497.0000,2020-04-29,0,0,344,0
1,497.0000,2020-05-29,1,0,344,1
2,497.0000,2020-06-29,2,0,344,2
3,497.0000,2020-07-29,3,0,344,3
4,497.0000,2020-08-29,4,0,344,4
...,...,...,...,...,...,...
18145,334.0625,2020-04-04,1,498,267,18145
18146,334.0625,2020-05-04,2,498,267,18146
18147,334.0625,2020-06-04,3,498,267,18147
18148,334.0625,2020-07-04,4,498,267,18148
18149,334.0625,2020-08-04,5,498,267,18149

In [29]:
Charges.remboursera.value_counts(normalize=True)

True     0.98
False    0.02
Name: remboursera, dtype: float64

In [30]:
Charges.drop(["remboursera","Mois de défaut"], axis=1, inplace=True)
Statements = Statements.drop(["charge_statement_no"], axis=1)
Payments = Payments.drop(["charge_statement_no"], axis=1)

In [31]:
Members

,member_no,lastname,firstname,phone_number,country,region_no,city,mail_code,street
0,0,Booker,Alexander,03467206581,United States,AR,Fayetteville,72701,17 West 26th Circle
1,1,Collins,Cynthia,05877106496,United States,KY,Louisville,40211,1522 South 36th Street
2,2,Gates,Christine,07112805123,United States,CA,Carson,90810,21950 Arnold Center Road
3,3,Watson,Rose,04613805255,United States,FL,Southport,32409,711 Tashanna Lane
4,4,Adkins,Jessica,01920641071,United States,TN,Nashville,37208,1816 14th Avenue
...,...,...,...,...,...,...,...,...,...
995,995,Johnson,David,05215591838,United States,CT,Manchester,06040,207 High Street
996,996,Costa,Marissa,06382176922,United States,OK,Oklahoma City,73118,1136 Northwest 31st Street
997,997,Khan,James,06220923360,United States,KY,Louisville,40211,2728 Hale Avenue
998,998,Reeves,Thomas,02299151551,United States,CA,Newark,94560,5715 Saint Matthew Drive
999,999,Horton,Nicole,08436260068,United States,MA,Medway,02053,14 School Street

In [32]:
Corporations

,corp_no,corp_name,phone_number,country,region_no,city,mail_code,street
0,0,"Barrera, Schmidt and Green",03407380857,United States,AZ,Glendale,85301,8595 North 71st Avenue
1,1,Zimmerman LLC,09006899744,United States,MA,Brookline,02446,19 Euston Street
2,2,"Williams, Jackson and Wood",04032788044,United States,AL,Montgomery,36116,3617 Oak Grove Circle
3,3,"Bishop, Martinez and Walker",08330738345,United States,CT,Manchester,06040,28 Wilfred Road
4,4,"Guerra, Coffey and Chaney",08331433557,United States,CA,Livermore,94550,266 South J Street
5,5,Mendoza PLC,07003149499,United States,AK,Anchorage,99507,4107 East 68th Avenue
6,6,Mckenzie PLC,06140095904,United States,KY,Louisville,40205,3408 Taylorsville Road
7,7,Cervantes and Sons,05969450454,United States,CA,Mountain View,94040,1954 Wilson Court
8,8,Reynolds-Bell,04715719510,United States,CO,Arvada,80002,8391 West 52nd Avenue
9,9,Smith-Allen,09975513839,United States,GA,Calhoun,30701,103 Aspen Place Northeast
10,10,Brewer-Hansen,01365855723,United States,AK,Anchorage,99517,3871 Galactica Drive
11,11,Holmes-James,01038086811,United States,CO,Arvada,80007,16896 West 85th Lane
12,12,Morgan Group,01860719679,United States,CA,Alameda,94501,11 Eclipse Court
13,13,"Hoffman, Gentry and Lawrence",02744525682,United States,DC,Washington,20011,5575 South Dakota Avenue Northeast
14,14,Campbell PLC,08628425864,United States,TN,Nashville,37214,846 Allen Road
15,15,"Brooks, Green and Fletcher",08078460427,United States,AL,Montgomery,36117,5680 Eddins Road
16,16,"Powell, Jones and Wagner",01436881552,United States,OK,Oklahoma City,73112,4132 Northwest 57th Street
17,17,Norton-Lowe,08383649067,United States,CT,Manchester,06040,200 West Center Street
18,18,Kelley and Sons,08256516534,United States,AR,Fayetteville,72701,412 West Ila Street
19,19,Walker and Sons,03393110655,United States,CA,Hayward,94544,28250 Dickens Avenue
20,20,Wilson-Harvey,03953866610,United States,OK,Oklahoma City,73114,312 Northwest 90th Street
21,21,"Jenkins, Shields and Palmer",09622207695,United States,FL,Panama City Beach,32408,4216 Lorraine Street
22,22,"Simmons, Tran and Moore",02974840329,United States,MD,Edgewater,21037,3579 2nd Avenue
23,23,Conner-Lindsey,08494769937,United States,FL,Panama City,32405,1803 Hickory Avenue
24,24,Weaver PLC,06437651484,United States,CT,Manchester,06040,173 Center Street
25,25,Gilbert LLC,07440445386,United States,AK,Anchorage,99508,2613 Cottonwood Street
26,26,"Blair, Baxter and Keith",03625502068,United States,AZ,Glendale,85306,5632 West Acoma Drive
27,27,Anderson Ltd,04227515087,United States,FL,Panama City,32408,8221 Surf Drive
28,28,Gonzales-Hart,01152282818,United States,FL,Mexico Beach,32456,3203 US Highway 98
29,29,Wolf Ltd,01706958858,United States,AR,Fayetteville,72701,971 Zenith Loop
30,30,"Spence, Baird and Hernandez",09566957934,United States,AL,Montgomery,36105,240 Lynwood Drive
31,31,Bender-Taylor,04219713858,United States,AR,Fayetteville,72703,2027 North Shannon Drive
32,32,Alexander-Carr,07521664706,United States,FL,Southport,32409,711 Tashanna Lane
33,33,Ward-Stafford,08998053627,United States,CO,Arvada,80007,8820 Culebra Street
34,34,"Hall, Rodriguez and Washington",03835944683,United States,MA,Norwood,02062,756 Neponset Street
35,35,Watson Group,04808787381,United States,MD,Edgewater,21037,241 Braxton Way
36,36,Smith Ltd,00949225310,United States,MA,Medford,02155,15 Mystic Avenue
37,37,"Orr, Estrada and Campbell",06464663016,United States,FL,Panama City Beach,32413,17878 Front Beach Road
38,38,"Knight, Wilson and Gill",08457902970,United States,KY,Louisville,40241,11102 Little Rock Court
39,39,"Oneill, Wise and Stewart",01020254904,United States,CA,Oakland,94621,1314 89th Avenue
40,40,Graves-Mckay,09359683757,United States,FL,Panama City,32404,5119 Marla Drive
41,41,Greene PLC,05462828389,United States,CA,Redding,96002,2641 Heather Lane
42,42,Hawkins Ltd,00609933996,United States,AZ,Peoria,85382,16040 North 67th Drive
43,43,"Snow, Roberts and Guzman",01134357836,United States,FL,Mexico Beach,32456,400 US Highway 98
44,44,Rangel LLC,09509897214,United States,TN,Nashville,37076,804 Old Coach Place
45,45,King and Sons,09758456916,United States,CO,Arvada,80005,7822 Club Crest Drive
46,46,Hall Group,08012565854,United States,CO,Arvada,80003,6215 Sheridan Boulevard
47,47,"Jones, Boyd and Harmon",09126692817,United States,MA,Watertown,02472,605 Main Street
48,48,"Stone, Wallace and Gordon",08056716857,United States,AL,Montgomery,36117,5600 Carmichael Road
49,49,Shelton Inc,04295254733,United States,DC,Washington,20012,6611 5th Street Northwest

In [33]:
Providers

,provider_no,provider_name,phone_number,country,region_no,city,mail_code,street,corp_no
0,0,Morgan Stanley,05714975151,United States,OK,Midwest City,73110,4408 Bonaparte Boulevard,10
1,1,JPMorgan Chase & Co,07643464419,United States,FL,Panama City,32404,5242 Thornton Lane,28
2,2,JPMorgan Chase & Co,03625548060,United States,AR,Fayetteville,72701,962 South Silverado Drive,35
3,3,Morgan Stanley,06681172159,United States,CA,Union City,94587,31353 Santa Elena Way,21
4,4,Bank of America,06174478754,United States,OK,Moore,73160,1513 Southeast 9th Street,16
5,5,Goldman Sachs,01771447569,United States,GA,Savannah,31419,103 Fenwick Village Drive,24
6,6,JPMorgan Chase & Co,02605138045,United States,AK,Anchorage,99577,25721 Berryhill Road,25
7,7,Goldman Sachs,08162631877,United States,AR,Fayetteville,72704,3537 West Chevaux Drive,6
8,8,US Bank,03569214452,United States,AR,Fayetteville,72703,4075 North Cadillac Drive,46
9,9,Morgan Stanley,02464101872,United States,GA,Pooler,31322,5 Tranquil Place,47
10,10,Wells Fargo,07784365260,United States,TN,Nashville,37210,90 Peabody Street,48
11,11,JPMorgan Chase & Co,04124882698,United States,CT,Manchester,06040,12 Kane Road,45
12,12,Bank of America,03008968459,United States,KY,Louisville,40245,1112 Flat Rock Road,40
13,13,Bank of America,05103109975,United States,AZ,Glendale,85308,6451 West Bell Road,41
14,14,Citigroup,03989950282,United States,CO,Fort Collins,80525,3438 Carlton Avenue,49
15,15,Citigroup,04852266119,United States,KY,Louisville,40218,1903 Bashford Manor Lane,30
16,16,Goldman Sachs,07142482021,United States,MA,Quincy,02169,45 Brackett Street,31
17,17,PNC Financial Services,03973750916,United States,AK,Anchorage,99516,16244 Seville Park Circle,6
18,18,PNC Financial Services,07608888666,United States,GA,Savannah,31415,1350 Exley Street,39
19,19,PNC Financial Services,09143122688,United States,CT,Manchester,06040,149 Lenox Street,10

In [34]:
Charges

,Charge type,Charge amount,Duration,dt,member_no,provider_no,charge_no
0,0,11928,24,2020-03-29,344,17,0
1,1,5000,48,2021-05-19,898,14,1
2,1,43430,36,2020-03-30,497,2,2
3,0,595,12,2021-12-09,697,19,3
4,1,16357,12,2021-01-27,864,18,4
...,...,...,...,...,...,...,...
495,1,5000,60,2020-06-30,36,9,495
496,1,5000,60,2020-01-10,261,19,496
497,0,5000,36,2021-05-12,897,9,497
498,0,16035,48,2020-02-04,267,6,498
499,0,25485,36,2021-11-28,743,3,499

In [39]:
Categories

        category_name  category_no
0  School credit loan            0
1    Real Estate loan            1
2       Consumer loan            2

In [35]:
Statements

       statement_amt     due_dt  charge_no  member_no  statement_no
0         497.000000 2020-04-29          0        344             0
1         497.000000 2020-05-29          0        344             1
2         497.000000 2020-06-29          0        344             2
3         497.000000 2020-07-29          0        344             3
4         497.000000 2020-08-29          0        344             4
...              ...        ...        ...        ...           ...
18223     707.916667 2024-07-28        499        743         18223
18224     707.916667 2024-08-28        499        743         18224
18225     707.916667 2024-09-28        499        743         18225
18226     707.916667 2024-10-28        499        743         18226
18227     707.916667 2024-11-28        499        743         18227

[18228 rows x 5 columns]

In [36]:
Payments

       payment_amt     due_dt  charge_no  member_no  payment_no
0         497.0000 2020-04-29          0        344           0
1         497.0000 2020-05-29          0        344           1
2         497.0000 2020-06-29          0        344           2
3         497.0000 2020-07-29          0        344           3
4         497.0000 2020-08-29          0        344           4
...            ...        ...        ...        ...         ...
18145     334.0625 2020-04-04        498        267       18145
18146     334.0625 2020-05-04        498        267       18146
18147     334.0625 2020-06-04        498        267       18147
18148     334.0625 2020-07-04        498        267       18148
18149     334.0625 2020-08-04        498        267       18149

[578 rows x 5 columns]

In [40]:
def export_csv():
    Members.to_csv('Members.csv')
    Corporations.to_csv('Corporations.csv')
    Categories.to_csv('Categories.csv')
    Providers.to_csv('Prodivers.csv')
    Charges.to_csv('Charges.csv')
    Statements.to_csv('Statements.csv')
    Payments.to_csv('Payments.csv')

In [41]:
export_csv()